"""
Формат входных данных
На вход программе подается строка.

Формат выходных данных
Программа должна вывести количество слов в строке.
"""


print(len(input().split()))
